CatApp/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "breed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "someone"], ["breed", "ugly"], ["created_at", "2019-05-24 15:28:12.534253"], ["updated_at", "2019-05-24 15:28:12.534253"]]
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Shadow-butt"], ["updated_at", "2019-05-24 16:09:04.403105"], ["id", 12]]
---
  def update
    if @cat.update(cat_params)